In [42]:
# Data Ingestion
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [43]:
url1 = 'https://raw.githubusercontent.com/ek-chris/Practice_datasets/refs/heads/main/home_loan_train.csv'
url2 = 'https://raw.githubusercontent.com/ek-chris/Practice_datasets/refs/heads/main/home_loan_test.csv'

In [44]:
data1 = pd.read_csv(url1)
data2 = pd.read_csv(url2)

In [45]:
data2.head(2)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban

In [46]:
dataset = pd.concat([data1, data2], axis=0, ignore_index=True)

In [47]:
dataset.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [48]:
# Lets pick out the numerical columns and get the descriptions
num_features = dataset.select_dtypes(include=['float64', 'int64']).columns
dataset[num_features].describe().T

,count,mean,std,min,25%,50%,75%,max
ApplicantIncome,981.0,5179.795107,5695.104533,0.0,2875.0,3800.0,5516.0,81000.0
CoapplicantIncome,981.0,1601.916330,2718.772806,0.0,0.0,1110.0,2365.0,41667.0
LoanAmount,954.0,142.511530,77.421743,9.0,100.0,126.0,162.0,700.0
Loan_Amount_Term,961.0,342.201873,65.100602,6.0,360.0,360.0,360.0,480.0
Credit_History,902.0,0.835920,0.370553,0.0,1.0,1.0,1.0,1.0

In [49]:
df = dataset.copy()
df.head(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y

In [50]:
df.head(2)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N

In [51]:
# 1. Applicatinc
(df, 'Applicantincome')

(      Loan_ID Gender Married Dependents     Education Self_Employed  \
 0    LP001002   Male      No          0      Graduate            No
 1    LP001003   Male     Yes          1      Graduate            No
 2    LP001005   Male     Yes          0      Graduate           Yes
 3    LP001006   Male     Yes          0  Not Graduate            No
 4    LP001008   Male      No          0      Graduate            No
 ..        ...    ...     ...        ...           ...           ...
 976  LP002971   Male     Yes         3+  Not Graduate           Yes
 977  LP002975   Male     Yes          0      Graduate            No
 978  LP002980   Male      No          0      Graduate            No
 979  LP002986   Male     Yes          0      Graduate            No
 980  LP002989   Male      No          0      Graduate           Yes

      ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
 0               5849                0.0         NaN             360.0
 1               4583             1508.0       128.0             360.0
 2               3000                0.0        66.0             360.0
 3               2583             2358.0       120.0             360.0
 4               6000                0.0       141.0             360.0
 ..               ...                ...         ...               ...
 976             4009             1777.0       113.0             360.0
 977             4158              709.0       115.0             360.0
 978             3250             1993.0       126.0             360.0
 979             5000             2393.0       158.0             360.0
 980             9200                0.0        98.0             180.0

      Credit_History Property_Area Loan_Status
 0               1.0         Urban           Y
 1               1.0         Rural           N
 2               1.0         Urban           Y
 3               1.0         Urban           Y
 4               1.0         Urban           Y
 ..              ...           ...         ...
 976             1.0         Urban         NaN
 977             1.0         Urban         NaN
 978             NaN     Semiurban         NaN
 979             1.0         Rural         NaN
 980             1.0         Rural         NaN

 [981 rows x 13 columns],
 'Applicantincome')